xwdreamer/baidu-iot-samples/ESP8266/arduino-sample/esp8266/tcpio_arduino.cpp
            // Arduino tlsio does not support any options
            tlsio_options_initialize(&tlsio_instance->options, TLSIO_OPTION_BIT_NONE);

            /* Codes_SRS_TLSIO_ARDUINO_21_015: [ The tlsio_arduino_create shall set 10 seconds for the sslClient timeout. ]*/
            //sslClient_setTimeout(10000);

            /* Codes_SRS_TLSIO_ARDUINO_21_016: [ The tlsio_arduino_create shall initialize all callback pointers as NULL. ]*/
            tlsio_instance->on_io_open_complete = NULL;
            tlsio_instance->on_io_open_complete_context = NULL;
            tlsio_instance->on_bytes_received = NULL;
            tlsio_instance->on_bytes_received_context = NULL;
            tlsio_instance->on_io_error = NULL;
            tlsio_instance->on_io_error_context = NULL;
            tlsio_instance->on_io_close_complete = NULL;
            tlsio_instance->on_io_close_complete_context = NULL;

            /* Codes_SRS_TLSIO_ARDUINO_21_020: [ If tlsio_arduino_create get success to create the tlsio instance, it shall set the tlsio state as TCPIO_ARDUINO_STATE_CLOSED. ]*/
            tlsio_instance->state = TCPIO_ARDUINO_STATE_CLOSED;

            /* Codes_SRS_TLSIO_ARDUINO_21_018: [ The tlsio_arduino_create shall convert the provide hostName to an IP address. ]*/
            if (WiFi.hostByName(tlsio_config->hostname, tlsio_instance->remote_addr))
            {
                tlsio_instance->port = (uint16_t)tlsio_config->port;
            }
            else
            {
                /* Codes_SRS_TLSIO_ARDUINO_21_019: [ If the WiFi cannot find the IP for the hostName, the tlsio_arduino_create shall destroy the sslClient and tlsio instances and return NULL as the handle. ]*/
                printf("Host %s not found.", tlsio_config->hostname);
                free(tlsio_instance);
                tlsio_instance = NULL;
            }
        }
    }

    /* Codes_SRS_TLSIO_ARDUINO_21_010: [ The tlsio_arduino_create shall return a non-NULL handle on success. ]*/
    return (CONCRETE_IO_HANDLE)tlsio_instance;
}

/* Codes_SRS_TLSIO_ARDUINO_21_021: [ The tlsio_arduino_destroy shall destroy a created instance of the tlsio for Arduino identified by the CONCRETE_IO_HANDLE. ]*/
void tcpio_arduino_destroy(CONCRETE_IO_HANDLE tlsio_handle)
{
    ArduinoTLS* tlsio_instance = (ArduinoTLS*)tlsio_handle;

    if (tlsio_handle == NULL)
    {
        /* Codes_SRS_TLSIO_ARDUINO_21_024: [ If the tlsio_handle is NULL, the tlsio_arduino_destroy shall not do anything. ]*/
        printf("NULL TLS handle.");
    }
    else
    {
        if ((tlsio_instance->state == TCPIO_ARDUINO_STATE_OPENING) ||
            (tlsio_instance->state == TCPIO_ARDUINO_STATE_OPEN) ||
            (tlsio_instance->state == TCPIO_ARDUINO_STATE_CLOSING))
        {
            /* Codes_SRS_TLSIO_ARDUINO_21_026: [ If the tlsio state is TCPIO_ARDUINO_STATE_OPENING, TCPIO_ARDUINO_STATE_OPEN, or TCPIO_ARDUINO_STATE_CLOSING, the tlsio_arduino_destroy shall close destroy the tlsio, but log an error. ]*/
            printf("TLS destroyed with a SSL connection still active.");
        }

        tlsio_options_release_resources(&tlsio_instance->options);
        /* Codes_SRS_TLSIO_ARDUINO_21_022: [ The tlsio_arduino_destroy shall free the memory allocated for tlsio_instance. ]*/
        free(tlsio_instance);
    }
}

/* Codes_SRS_TLSIO_ARDUINO_21_026: [ The tlsio_arduino_open shall star the process to open the ssl connection with the host provided in the tlsio_arduino_create. ]*/
int tcpio_arduino_open(
    CONCRETE_IO_HANDLE tlsio_handle,
    ON_IO_OPEN_COMPLETE on_io_open_complete,
    void* on_io_open_complete_context,
    ON_BYTES_RECEIVED on_bytes_received,
    void* on_bytes_received_context,
    ON_IO_ERROR on_io_error,
    void* on_io_error_context)
{
    int result;
    ArduinoTLS* tlsio_instance = (ArduinoTLS*)tlsio_handle;
    if (tlsio_handle == NULL)
    {
        /* Codes_SRS_TLSIO_ARDUINO_21_036: [ If the tlsio_handle is NULL, the tlsio_arduino_open shall not do anything, and return _LINE_. ]*/
        printf("NULL TLS handle.");
        result = __FAILURE__;
    }
    else
    {
        /* Codes_SRS_TLSIO_ARDUINO_21_004: [ The tlsio_arduino shall call the callbacks functions defined in the `xio.h`. ]*/
        /* Codes_SRS_TLSIO_ARDUINO_21_006: [ The tlsio_arduino shall return the status of all async operations using the callbacks. ]*/
        /* Codes_SRS_TLSIO_ARDUINO_21_007: [ If the callback function is set as NULL. The tlsio_arduino shall not call anything. ]*/
        /* Codes_SRS_TLSIO_ARDUINO_21_028: [ The tlsio_arduino_open shall store the provided on_io_open_complete callback function address. ]*/
        tlsio_instance->on_io_open_complete = on_io_open_complete;
        /* Codes_SRS_TLSIO_ARDUINO_21_029: [ The tlsio_arduino_open shall store the provided on_io_open_complete_context handle. ]*/
        tlsio_instance->on_io_open_complete_context = on_io_open_complete_context;

        /* Codes_SRS_TLSIO_ARDUINO_21_030: [ The tlsio_arduino_open shall store the provided on_bytes_received callback function address. ]*/
        tlsio_instance->on_bytes_received = on_bytes_received;
        /* Codes_SRS_TLSIO_ARDUINO_21_031: [ The tlsio_arduino_open shall store the provided on_bytes_received_context handle. ]*/
        tlsio_instance->on_bytes_received_context = on_bytes_received_context;

        /* Codes_SRS_TLSIO_ARDUINO_21_032: [ The tlsio_arduino_open shall store the provided on_io_error callback function address. ]*/
        tlsio_instance->on_io_error = on_io_error;
        /* Codes_SRS_TLSIO_ARDUINO_21_033: [ The tlsio_arduino_open shall store the provided on_io_error_context handle. ]*/
        tlsio_instance->on_io_error_context = on_io_error_context;

        if ((tlsio_instance->state == TCPIO_ARDUINO_STATE_ERROR) ||
            (tlsio_instance->state == TCPIO_ARDUINO_STATE_OPENING) ||
            (tlsio_instance->state == TCPIO_ARDUINO_STATE_OPEN) ||
            (tlsio_instance->state == TCPIO_ARDUINO_STATE_CLOSING))
        {
            /* Codes_SRS_TLSIO_ARDUINO_21_035: [ If the tlsio state is TCPIO_ARDUINO_STATE_ERROR, TCPIO_ARDUINO_STATE_OPENING, TCPIO_ARDUINO_STATE_OPEN, or TCPIO_ARDUINO_STATE_CLOSING, the tlsio_arduino_open shall set the tlsio state as TCPIO_ARDUINO_STATE_ERROR, and return _LINE_. ]*/
            printf("Try to open a connection with an already opened TLS.");
            tlsio_instance->state = TCPIO_ARDUINO_STATE_ERROR;
            result = __FAILURE__;
        }
        else
        {
            printf("==> wifiClient_connect\r\n");
            if (wifiClient.connected())
            {
                /* Codes_SRS_TLSIO_ARDUINO_21_037: [ If the ssl client is connected, the tlsio_arduino_open shall change the state to TCPIO_ARDUINO_STATE_ERROR, log the error, and return _LINE_. ]*/
                printf("No SSL clients available.");
                tlsio_instance->state = TCPIO_ARDUINO_STATE_ERROR;
                result = __FAILURE__;
            }
            /* Codes_SRS_TLSIO_ARDUINO_21_027: [ The tlsio_arduino_open shall set the tlsio to try to open the connection for 10 times before assuming that connection failed. ]*/
            else if (wifiClient.connect(tlsio_instance->remote_addr, tlsio_instance->port))
            {
                printf("connect  success!\r\n");
                /* Codes_SRS_TLSIO_ARDUINO_21_034: [ If tlsio_arduino_open get success to start the process to open the ssl connection, it shall set the tlsio state as TCPIO_ARDUINO_STATE_OPENING, and return 0. ]*/
                tlsio_instance->state = TCPIO_ARDUINO_STATE_OPENING;
                tlsio_instance->countTry = MAX_TLS_OPENING_RETRY;
                result = 0;
            }
            else
            {
                /* Codes_SRS_TLSIO_ARDUINO_21_038: [ If tlsio_arduino_open failed to start the process to open the ssl connection, it shall set the tlsio state as TCPIO_ARDUINO_STATE_ERROR, and return _LINE_. ]*/
                printf("TLS failed to start the connection process.");
                tlsio_instance->state = TCPIO_ARDUINO_STATE_ERROR;
                result = __FAILURE__;
            }
        }
    }

