xwdreamer/baidu-iot-samples/ESP8266/arduino-sample/esp8266/tcpio_arduino.cpp
        switch (tlsio_instance->state)
        {
        case TCPIO_ARDUINO_STATE_OPENING:
            if (wifiClient.connected())
            {
                /* Codes_SRS_TLSIO_ARDUINO_21_063: [ If the tlsio state is TCPIO_ARDUINO_STATE_OPENING, and ssl client is connected, the tlsio_arduino_dowork shall change the tlsio state to TCPIO_ARDUINO_STATE_OPEN, and call the on_io_open_complete with IO_OPEN_OK. ]*/
                tlsio_instance->state = TCPIO_ARDUINO_STATE_OPEN;
                /* Codes_SRS_TLSIO_ARDUINO_21_002: [ The tlsio_arduino shall report the open operation status using the IO_OPEN_RESULT enumerator defined in the `xio.h`.]*/
                CallOpenCallback(IO_OPEN_OK);
            }
            /* Codes_SRS_TLSIO_ARDUINO_21_064: [ If the tlsio state is TCPIO_ARDUINO_STATE_OPENING, and ssl client is not connected, the tlsio_arduino_dowork shall decrement the counter of trys for opening. ]*/
            else if ((tlsio_instance->countTry--) <= 0)
            {
                /* Codes_SRS_TLSIO_ARDUINO_21_065: [ If the tlsio state is TCPIO_ARDUINO_STATE_OPENING, ssl client is not connected, and the counter to try becomes 0, the tlsio_arduino_dowork shall change the tlsio state to TCPIO_ARDUINO_STATE_ERROR, call on_io_open_complete with IO_OPEN_CANCELLED, call on_io_error. ]*/
                tlsio_instance->state = TCPIO_ARDUINO_STATE_ERROR;
                printf("Timeout for TLS connect.");
                /* Codes_SRS_TLSIO_ARDUINO_21_002: [ The tlsio_arduino shall report the open operation status using the IO_OPEN_RESULT enumerator defined in the `xio.h`.]*/
                /* Codes_SRS_TLSIO_ARDUINO_21_042: [ If the tlsio_arduino_open retry to open more than 10 times without success, it shall call the on_io_open_complete with IO_OPEN_CANCELED. ]*/
                CallOpenCallback(IO_OPEN_CANCELLED);
                CallErrorCallback();
            }
            break;
        case TCPIO_ARDUINO_STATE_OPEN:
            if (!wifiClient.connected())
            {
                /* Codes_SRS_TLSIO_ARDUINO_21_071: [ If the tlsio state is TCPIO_ARDUINO_STATE_OPEN, and ssl client is not connected, the tlsio_arduino_dowork shall change the state to TCPIO_ARDUINO_STATE_ERROR, call on_io_error. ]*/
                tlsio_instance->state = TCPIO_ARDUINO_STATE_ERROR;
                printf("SSL closed the connection.");
                CallErrorCallback();
            }
            else
            {
                char b;
                uint8_t recv_buf[32];
                size_t recv_len;
                /* Codes_SRS_TLSIO_ARDUINO_21_069: [ If the tlsio state is TCPIO_ARDUINO_STATE_OPEN, the tlsio_arduino_dowork shall read data from the ssl client. ]*/
                while ((recv_len = wifiClient.readBytes(recv_buf, sizeof(recv_buf))) > 0) {
                    if (tlsio_instance->on_bytes_received != NULL) {
                      printf("recvd %d\r\n", recv_len);
                        (void)tlsio_instance->on_bytes_received(tlsio_instance->on_bytes_received_context, recv_buf, recv_len);
                    }
                }
            }
            break;
        case TCPIO_ARDUINO_STATE_CLOSING:
            if (!wifiClient.connected())
            {
                /* Codes_SRS_TLSIO_ARDUINO_21_066: [ If the tlsio state is TCPIO_ARDUINO_STATE_CLOSING, and ssl client is not connected, the tlsio_arduino_dowork shall change the tlsio state to TCPIO_ARDUINO_STATE_CLOSE, and call the on_io_close_complete. ]*/
                tlsio_instance->state = TCPIO_ARDUINO_STATE_CLOSED;
                CallCloseCallback();
            }
            /* Codes_SRS_TLSIO_ARDUINO_21_067: [ If the tlsio state is TCPIO_ARDUINO_STATE_CLOSING, and ssl client is connected, the tlsio_arduino_dowork shall decrement the counter of trys for closing. ]*/
            else if ((tlsio_instance->countTry--) <= 0)
            {
                /* Codes_SRS_TLSIO_ARDUINO_21_051: [ If the tlsio_arduino_close retry to close more than 10 times without success, it shall call the on_io_error. ]*/
                /* Codes_SRS_TLSIO_ARDUINO_21_068: [ If the tlsio state is TCPIO_ARDUINO_STATE_CLOSING, ssl client is connected, and the counter to try becomes 0, the tlsio_arduino_dowork shall change the tlsio state to TCPIO_ARDUINO_STATE_ERROR, call on_io_error. ]*/
                tlsio_instance->state = TCPIO_ARDUINO_STATE_ERROR;
                printf("Timeout for close TLS");
                CallErrorCallback();

            }
            break;
        case TCPIO_ARDUINO_STATE_CLOSED:
            if (wifiClient.connected())
            {
                /* Codes_SRS_TLSIO_ARDUINO_21_072: [ If the tlsio state is TCPIO_ARDUINO_STATE_CLOSED, and ssl client is connected, the tlsio_arduino_dowork shall change the state to TCPIO_ARDUINO_STATE_ERROR, call on_io_error. ]*/
                tlsio_instance->state = TCPIO_ARDUINO_STATE_ERROR;
                printf("SSL keep the connection open with TLS closed.");
                CallErrorCallback();
            }
        case TCPIO_ARDUINO_STATE_ERROR:
            /* Codes_SRS_TLSIO_ARDUINO_21_073: [ If the tlsio state is TCPIO_ARDUINO_STATE_ERROR, the tlsio_arduino_dowork shall not do anything. ]*/
        default:
            break;
        }
    }
}

int tcpio_arduino_setoption(CONCRETE_IO_HANDLE tlsio_handle, const char* optionName, const void* value)
{
    ArduinoTLS* tls_io_instance = (ArduinoTLS*)tlsio_handle;
    /* Codes_SRS_TLSIO_30_120: [ If the tlsio_handle parameter is NULL, tlsio_openssl_compact_setoption shall do nothing except log an error and return FAILURE. ]*/
    int result;
    if (tls_io_instance == NULL)
    {
        printf("NULL tlsio");
        result = __FAILURE__;
    }
    else
    {
        /* Codes_SRS_TLSIO_30_121: [ If the optionName parameter is NULL, tlsio_setoption shall do nothing except log an error and return FAILURE. ]*/
        /* Codes_SRS_TLSIO_30_122: [ If the value parameter is NULL, tlsio_setoption shall do nothing except log an error and return FAILURE. ]*/
        /* Codes_SRS_TLSIO_ARDUINO_21_077: [ The tlsio_arduino_setoption shall not do anything, and return  __FAILURE__ . ]*/
        TLSIO_OPTIONS_RESULT options_result = tlsio_options_set(&tls_io_instance->options, optionName, value);
        if (options_result != TLSIO_OPTIONS_RESULT_SUCCESS)
        {
            printf("Failed tlsio_options_set");
            result = __FAILURE__;
        }
        else
        {
            result = 0;
        }
    }
    return result;
}

OPTIONHANDLER_HANDLE tcpio_arduino_retrieveoptions(CONCRETE_IO_HANDLE tlsio_handle)
{
    ArduinoTLS* tls_io_instance = (ArduinoTLS*)tlsio_handle;
    /* Codes_SRS_TLSIO_ARDUINO_21_078: [ The tlsio_arduino_retrieveoptions shall return an empty options handler. ]*/
    OPTIONHANDLER_HANDLE result;
    if (tls_io_instance == NULL)
    {
        printf("NULL tlsio");
        result = NULL;
    }
    else
    {
        //result = tcpio_options_retrieve_options(&tls_io_instance->options, tcpio_arduino_setoption);
        result = NULL;
    }
    return result;
}
